org-init/mail-in-emacs.org
#+SETUPFILE: ~/.emacs.d/org-init/level-0.orgsetup
* Mail with Emacs
  :PROPERTIES:
  :noweb:    no-export
  :exports:  code
  :END:
  #+BEGIN_SRC emacs-lisp :exports none
   ;; -*- lexical-binding: t -*-
  #+END_SRC

** Maintaining Secrets
*** GPG Encryption

    #+BEGIN_SRC emacs-lisp
    (require 'epa-file)
    (epa-file-enable)
    #+END_SRC

*** =auth-sources=
    :PROPERTIES:
    :tangle:   no
    :END:

    - [[elisp:(customize-variable 'auth-sources)][Customize auth-sources]]
    - To enable debug information:
      #+BEGIN_SRC emacs-lisp
        (setq auth-source-debug t)
      #+END_SRC
    - To clear the Emacs authentication cache:
      #+BEGIN_SRC emacs-lisp
        (auth-source-forget-all-cached)
      #+END_SRC
    - The current set of sources:
      #+name: current-sources
      #+BEGIN_SRC emacs-lispt :results list
        auth-sources
      #+END_SRC

      #+RESULTS: current-sources
      - ~/.emacs.d/secrets/.authinfo.gpg
      - macos-keychain-internet

