mail-in-emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-03-04 Sun 00:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Toby Tripp" />
<link rel="stylesheet"  href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.2/css/bootstrap.min.css">
<link rel="stylesheet" href="css/htmlize.css">
<link rel="stylesheet" href="css/config.css">
</head>
<body>
<div id="preamble" class="status">
<p><a accesskey="H" href="index.html">HOME</a></p>
</div>
<div id="content">
<div id="outline-container-org696026b" class="outline-2">
<h2 id="org696026b">Mail with Emacs</h2>
<div class="outline-text-2" id="text-org696026b">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #586e75;">;; </span><span style="color: #586e75;">-*- lexical-binding: t -*-</span>
</pre>
</div>
</div>
<div id="outline-container-org6482a0c" class="outline-3">
<h3 id="org6482a0c">Maintaining Secrets</h3>
<div class="outline-text-3" id="text-org6482a0c">
</div>
<div id="outline-container-org1506ca6" class="outline-4">
<h4 id="org1506ca6">GPG Encryption</h4>
<div class="outline-text-4" id="text-org1506ca6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">require</span> '<span style="color: #268bd2; font-weight: bold;">epa-file</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span>epa-file-enable<span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf69a1c0" class="outline-4">
<h4 id="orgf69a1c0"><code>auth-sources</code></h4>
<div class="outline-text-4" id="text-orgf69a1c0">
<ul class="org-ul">
<li><a href="(customize-variable 'auth-sources)">Customize auth-sources</a></li>
<li><p>
To enable debug information:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">setq</span> auth-source-debug t<span style="color: #2aa198;">)</span>
</pre>
</div></li>
<li><p>
To clear the Emacs authentication cache:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span>auth-source-forget-all-cached<span style="color: #2aa198;">)</span>
</pre>
</div></li>
<li><p>
The current set of sources:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgdab5bec">auth-sources
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">~/.emacs.d/secrets/.authinfo.gpg</td>
<td class="org-left">macos-keychain-internet</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">~/.emacs.d/secrets/.authinfo.gpg</td>
<td class="org-left">macos-keychain-internet</td>
</tr>
</tbody>
</table></li>
</ul>
</div>
</div>
