org-init/mail-in-emacs.org
*** Authentication Secret Look-up
    - Require the =auth-sources= library
      #+name: require-auth-source
      #+BEGIN_SRC emacs-lisp
        (require 'auth-source)
      #+END_SRC
    - =auth-sources= usage

      The =auth-source-search= function takes a “search spec” plist and
      returns a list with all matching entries.  The results themselves are
      plists containing full entries that matched the search spec.

      #+name: search-example
      #+BEGIN_SRC emacs-lisp :tangle no
        (auth-source-search :user "toby.tripp")
      #+END_SRC

      The =:secret= entry will be a lambda that, when evaluated,
      will return the password.

      #+name: parse-results-example
      #+BEGIN_SRC emacs-lisp :tangle no :results value
        (let* ((matches (auth-source-search
                         :user "toby.tripp"
                         :max 1
                         :require '(:secret)))
               (entry (nth 0 matches))
               (secret (plist-get entry :secret)))
          (list
           (list :user   (plist-get entry :user))
           (list :host   (plist-get entry :host))
           (list :port   (plist-get entry :port))
           (list :secret (funcall secret))))
      #+END_SRC

      #+RESULTS: parse-results-example
      | :user   | toby.tripp        |
      | :host   | example.server    |
      | :port   | 80                |
      | :secret | incredible-secret |

      We will define a function for returning a single =auth-sources= result as
      an =alist=:

      #+name: helper-definition
      #+BEGIN_SRC emacs-lisp
        (defun toby/auth-info (&rest search-spec)
          "Given a LOGIN to search for, return `auth-sources' that match.

        Valid search keys are:

          - :user
          - :host
          - :port

        Setting :max will have no result as this function only returns a
        single result.  If there are multiple matches, the first will be
        returned.

        Results are returned as an alist with the `:secret' property
        pre-evaluated."

          (dolist (default '((:max . 1) (:require . (:secret))))
            (plist-put search-spec (car default) (cdr default)))

          (let ((entry (nth 0 (apply 'auth-source-search search-spec))))
            (mapcar (lambda (e)
                      (let ((prop  (car e))
                            (value (if (functionp (cadr e))
                                       (funcall (cadr e))
                                     (cadr e))))
                        (cons prop value)))
                    (seq-partition entry 2))))
      #+END_SRC

      For example, given an =.authinfo= file containing:
      #+name: authinfo-example
      #+BEGIN_EXAMPLE
        machine example.server login toby.tripp port 80 password incredible-secret
      #+END_EXAMPLE

      and then the following call:

      #+name: call-example
      #+BEGIN_SRC emacs-lisp :tangle no :results verbatim
        (toby/auth-info :user "toby.tripp")
      #+END_SRC

      #+RESULTS: call-example
      : ((:host . "example.server") (:user . "toby.tripp") (:port . "80") (:secret . "incredible-secret"))

      We can then, for example, get just the password like this:

      #+name: getting-password
      #+BEGIN_SRC emacs-lisp :tangle no :results verbatim
        (alist-get :secret (toby/auth-info :user "toby.tripp"))
      #+END_SRC

      #+RESULTS: getting-password
      : "incredible-secret"

