mail-in-emacs.html

<div id="outline-container-orgc056eab" class="outline-4">
<h4 id="orgc056eab">Authentication Secret Look-up</h4>
<div class="outline-text-4" id="text-orgc056eab">
<ul class="org-ul">
<li><p>
Require the <code>auth-sources</code> library
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org2fa8a15"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">require</span> '<span style="color: #268bd2; font-weight: bold;">auth-source</span><span style="color: #2aa198;">)</span>
</pre>
</div></li>
<li><p>
<code>auth-sources</code> usage
</p>

<p>
The <code>auth-source-search</code> function takes a “search spec” plist and
returns a list with all matching entries.  The results themselves are
plists containing full entries that matched the search spec.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org54699b3"><span style="color: #2aa198;">(</span>auth-source-search <span style="color: #268bd2; font-style: italic;">:user</span> <span style="color: #2aa198;">"toby.tripp"</span><span style="color: #2aa198;">)</span>
</pre>
</div>

<p>
The <code>:secret</code> entry will be a lambda that, when evaluated,
will return the password.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orge43ed8b"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">let*</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">(</span>matches <span style="color: #dc322f;">(</span>auth-source-search
                 <span style="color: #268bd2; font-style: italic;">:user</span> <span style="color: #2aa198;">"toby.tripp"</span>
                 <span style="color: #268bd2; font-style: italic;">:max</span> 1
                 <span style="color: #268bd2; font-style: italic;">:require</span> '<span style="color: #cb4b16;">(</span><span style="color: #268bd2; font-style: italic;">:secret</span><span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>
       <span style="color: #268bd2;">(</span>entry <span style="color: #dc322f;">(</span>nth 0 matches<span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>
       <span style="color: #268bd2;">(</span>secret <span style="color: #dc322f;">(</span>plist-get entry <span style="color: #268bd2; font-style: italic;">:secret</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>list
   <span style="color: #268bd2;">(</span>list <span style="color: #268bd2; font-style: italic;">:user</span>   <span style="color: #dc322f;">(</span>plist-get entry <span style="color: #268bd2; font-style: italic;">:user</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>
   <span style="color: #268bd2;">(</span>list <span style="color: #268bd2; font-style: italic;">:host</span>   <span style="color: #dc322f;">(</span>plist-get entry <span style="color: #268bd2; font-style: italic;">:host</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>
   <span style="color: #268bd2;">(</span>list <span style="color: #268bd2; font-style: italic;">:port</span>   <span style="color: #dc322f;">(</span>plist-get entry <span style="color: #268bd2; font-style: italic;">:port</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>
   <span style="color: #268bd2;">(</span>list <span style="color: #268bd2; font-style: italic;">:secret</span> <span style="color: #dc322f;">(</span>funcall secret<span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">:user</td>
<td class="org-left">toby.tripp</td>
</tr>

<tr>
<td class="org-left">:host</td>
<td class="org-left">example.server</td>
</tr>

<tr>
<td class="org-left">:port</td>
<td class="org-left">80</td>
</tr>

<tr>
<td class="org-left">:secret</td>
<td class="org-left">incredible-secret</td>
</tr>
</tbody>
</table>

<p>
We will define a function for returning a single <code>auth-sources</code> result as
an <code>alist</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org678a908"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">toby/auth-info</span> <span style="color: #b58900;">(</span><span style="color: #b58900;">&amp;rest</span> search-spec<span style="color: #b58900;">)</span>
  <span style="color: #2aa198; font-style: italic;">"Given a LOGIN to search for, return `</span><span style="color: #268bd2; font-weight: bold; font-style: italic;">auth-sources</span><span style="color: #2aa198; font-style: italic;">' that match.</span>

<span style="color: #2aa198; font-style: italic;">Valid search keys are:</span>

<span style="color: #2aa198; font-style: italic;">  - :user</span>
<span style="color: #2aa198; font-style: italic;">  - :host</span>
<span style="color: #2aa198; font-style: italic;">  - :port</span>

<span style="color: #2aa198; font-style: italic;">Setting :max will have no result as this function only returns a</span>
<span style="color: #2aa198; font-style: italic;">single result.  If there are multiple matches, the first will be</span>
<span style="color: #2aa198; font-style: italic;">returned.</span>

<span style="color: #2aa198; font-style: italic;">Results are returned as an alist with the `</span><span style="color: #268bd2; font-weight: bold; font-style: italic;">:secret</span><span style="color: #2aa198; font-style: italic;">' property</span>
<span style="color: #2aa198; font-style: italic;">pre-evaluated."</span>

  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">dolist</span> <span style="color: #268bd2;">(</span>default '<span style="color: #dc322f;">(</span><span style="color: #cb4b16;">(</span><span style="color: #268bd2; font-style: italic;">:max</span> . 1<span style="color: #cb4b16;">)</span> <span style="color: #cb4b16;">(</span><span style="color: #268bd2; font-style: italic;">:require</span> . <span style="color: #268bd2;">(</span><span style="color: #268bd2; font-style: italic;">:secret</span><span style="color: #268bd2;">)</span><span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>plist-put search-spec <span style="color: #dc322f;">(</span>car default<span style="color: #dc322f;">)</span> <span style="color: #dc322f;">(</span>cdr default<span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>

  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">(</span><span style="color: #dc322f;">(</span>entry <span style="color: #cb4b16;">(</span>nth 0 <span style="color: #268bd2;">(</span>apply 'auth-source-search search-spec<span style="color: #268bd2;">)</span><span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>mapcar <span style="color: #dc322f;">(</span><span style="color: #859900; font-weight: bold;">lambda</span> <span style="color: #cb4b16;">(</span>e<span style="color: #cb4b16;">)</span>
              <span style="color: #cb4b16;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">(</span><span style="color: #859900;">(</span>prop  <span style="color: #dc322f;">(</span>car e<span style="color: #dc322f;">)</span><span style="color: #859900;">)</span>
                    <span style="color: #859900;">(</span>value <span style="color: #dc322f;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span>functionp <span style="color: #2aa198;">(</span>cadr e<span style="color: #2aa198;">)</span><span style="color: #b58900;">)</span>
                               <span style="color: #b58900;">(</span>funcall <span style="color: #2aa198;">(</span>cadr e<span style="color: #2aa198;">)</span><span style="color: #b58900;">)</span>
                             <span style="color: #b58900;">(</span>cadr e<span style="color: #b58900;">)</span><span style="color: #dc322f;">)</span><span style="color: #859900;">)</span><span style="color: #268bd2;">)</span>
                <span style="color: #268bd2;">(</span>cons prop value<span style="color: #268bd2;">)</span><span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span>
            <span style="color: #dc322f;">(</span>seq-partition entry 2<span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>

<p>
For example, given an <code>.authinfo</code> file containing:
</p>
<pre class="example" id="authinfo-example">
machine example.server login toby.tripp port 80 password incredible-secret
</pre>

<p>
and then the following call:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org52be144"><span style="color: #2aa198;">(</span>toby/auth-info <span style="color: #268bd2; font-style: italic;">:user</span> <span style="color: #2aa198;">"toby.tripp"</span><span style="color: #2aa198;">)</span>
</pre>
</div>

<pre class="example">
((:host . "example.server") (:user . "toby.tripp") (:port . "80") (:secret . "incredible-secret"))

</pre>

<p>
We can then, for example, get just the password like this:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org7804b96"><span style="color: #2aa198;">(</span>alist-get <span style="color: #268bd2; font-style: italic;">:secret</span> <span style="color: #b58900;">(</span>toby/auth-info <span style="color: #268bd2; font-style: italic;">:user</span> <span style="color: #2aa198;">"toby.tripp"</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>

<pre class="example">
"incredible-secret"

</pre></li>
</ul>
</div>
</div>
