org-init/mail-in-emacs.org
*** Secret Configurations

    Facilities for the evaluation of encrypted elisp configuration.

    #+name: secret-helper-definition
    #+BEGIN_SRC emacs-lisp
      (defun toby/get-secret-var (sym)
        "Get the value of the symbol `sym' from the custom.el.gpg
        customization/configuration file."
        (with-temp-buffer
          (insert-file-contents "~/.emacs.d/secrets/custom.el.gpg")
          (eval-buffer)
          (alist-get sym toby/secret-custom)))
    #+END_SRC

    #+name: get-secret
    #+header: :var property="gmail-user"
    #+BEGIN_SRC emacs-lisp
      (toby/get-secret-var (intern property))
    #+END_SRC

** ADOPTED mbsync
   :PROPERTIES:
   :tangle: ~/.mbsyncrc
   :tanble-mode: (identity #o640)
   :noweb: no-export
   :END:

   - State "EXPERIMENTAL" from "TODO"     [2018-02-13 Tue 07:25]
   - State "TODO"       from              [2018-02-13 Tue 07:25]

   - [[https://wiki.archlinux.org/index.php/Isync][ArchLinux Help Page]]
   - [[http://isync.sourceforge.net/mbsync.html][mbsync man page]]
   - [[http://pragmaticemacs.com/emacs/migrating-from-offlineimap-to-mbsync-for-mu4e/][Pragmatic Emacs mbsync Page]]

   #+header: :tangle-mode (identity #o640)
   #+BEGIN_SRC conf :tangle ~/.mbsyncrc
     # -*- mode: conf -*-
     Expunge Both
     SyncState *
   #+END_SRC

*** GMail
   :PROPERTIES:
   :tangle: ~/.mbsyncrc
   :tangle-mode: (identity #o640)
   :noweb: no-export
   :END:

    A script for retrieving encrypted authinfo
    #+name: gmail-password
    #+BEGIN_SRC sh :tangle no
      gpg2 -q --for-your-eyes-only --no-tty -d ~/.emacs.d/secrets/.authinfo.gpg | awk '/imap\.gmail/ { print $8 }'
    #+END_SRC

    The mbsync configuration for the gmail account
    #+name: gmail-account
    #+header: :noweb no-export
    #+BEGIN_SRC conf :tangle ~/.mbsyncrc
     IMAPAccount gmail
     Host imap.gmail.com
     Port 993
     User <<get-secret(property="gmail-user")>>
     AuthMechs LOGIN
     SSLType IMAPS
     SystemCertificates no
     CertificateFile /usr/local/etc/openssl/cert.pem
     PassCmd "<<gmail-password>>"

     IMAPStore gmail-remote
     Account gmail
    #+END_SRC

    Trailing slashes in mail directory entries are important.

    #+name: Gmail Maildir Storage
    #+BEGIN_SRC conf :tangle ~/.mbsyncrc
      MaildirStore gmail-local
      Path ~/.mail/gmail/
      Inbox ~/.mail/gmail/Inbox
      SubFolders Verbatim
    #+END_SRC

    Patterns match remote mail folders for syncing:

    #+tblname pattern-examples
    | Pattern | Meaning          |
    |---------+------------------|
    | *       | Match everything |
    | !DIR    | Exclude DIR      |
    | DIR     | Include DIR      |

    For example:
    #+name: gmail-patterns-example
    #+BEGIN_SRC conf :tangle no
      Patterns ![Gmail]* "[Gmail]/Sent Mail" "[Gmail]/Starred" "[Gmail]/All Mail"
    #+END_SRC

    #+name: Gmail Channels
    #+header: :tangle ~/.mbsyncrc
    #+BEGIN_SRC conf
      Channel gmail-inbox
      Master :gmail-remote:
      Slave :gmail-local:
      Patterns "INBOX" "Record*" "Group*"
      Create Both

      Channel gmail-trash
      Master :gmail-remote:"[Gmail]/Trash"
      Slave :gmail-local:trash
      Create Both
      Expunge Both

      Channel gmail-sent
      Master :gmail-remote:"[Gmail]/Sent Mail"
      Slave :gmail-local:sent
      Create Both
      Expunge Both

      Channel gmail-archive
      Master ":gmail-remote:[Gmail]/All Mail"
      Slave :gmail-local:archive
      Create Both
    #+END_SRC

    Groups put together Channels, so that we can invoke =mbsync= on a Group to
    sync all Channels, for instance: =mbsync gmail= gets mail from
    "gmail-inbox", "gmail-sent", and "gmail-trash"

    #+name: Gmail Groups
    #+header: :tangle ~/.mbsyncrc
    #+BEGIN_SRC conf
      Group gmail
      Channel gmail-inbox
      Channel gmail-sent
      Channel gmail-trash
      Channel gmail-archive
    #+END_SRC

    #+name: gmail-mailbox-list
    #+BEGIN_SRC sh :tangle no :results output
      mkdir -p ~/.mail/gmail
      mbsync -al
    #+END_SRC

*** iCloud
   :PROPERTIES:
   :tangle: ~/.mbsyncrc
   :tanble-mode: (identity #o640)
   :noweb: no-export
   :END:

    This configuration uses authentication info stored in the MacOS Keychain.
    I'm not convinced this is better or worse than authinfo.

    #+name: iCloud-Account
    #+header: :tangle ~/.mbsyncrc
    #+header: :noweb no-export
    #+BEGIN_SRC conf
      IMAPAccount icloud
      Host imap.mail.me.com
      Port 993
      User <<get-secret(property="icloud-user")>>
      PassCmd "security find-internet-password -s imap.mail.me.com -w"
      AuthMechs LOGIN PLAIN
      SSLType IMAPS
      SSLVersions TLSv1.2
      SystemCertificates no
      CertificateFile /usr/local/etc/openssl/cert.pem

      IMAPStore icloud-remote
      Account icloud
    #+END_SRC

    #+name: iCloud Maildir Storage
    #+header: :tangle ~/.mbsyncrc
    #+BEGIN_SRC conf
      MaildirStore icloud-local
      Path ~/.mail/icloud/
      Inbox ~/.mail/icloud/Inbox
      Trash Trash
    #+END_SRC

    #+name: iCloud Channels
    #+header: :tangle ~/.mbsyncrc
    #+BEGIN_SRC conf
      Channel icloud-folders
      Master :icloud-remote:
      Slave :icloud-local:
      Patterns "INBOX" "Saved" "Drafts" "Archive" "Sent*" "Trash"
      Create Both
      Expunge Both
      SyncState *
    #+END_SRC

    #+name: iCloud Groups
    #+header: :tangle ~/.mbsyncrc
    #+BEGIN_SRC conf
      Group icloud
      Channel icloud-folders
    #+END_SRC

    #+name: icloud-mailbox-list
    #+BEGIN_SRC sh :tangle no :results output
      mkdir -p ~/.mail/icloud
      mbsync -l icloud
    #+END_SRC

    #+RESULTS: icloud-mailbox-list
    : INBOX
    : Archive
    : Drafts
    : Sent Messages
    : Trash

** Under MacOS, this script can be triggered by =launchd= with the following plist:
   #+name: mail-sync-path
   #+header: :results value
   #+header: :tangle no
   #+BEGIN_SRC emacs-lisp
     (file-truename "~/bin/mail-sync")
   #+END_SRC

   #+RESULTS: absolute-path
   : /Users/toby/.emacs.d/bin/emacs-daemon


   #+name: mbsync plist
   #+header: :noweb no-export
   #+header: :tangle ~/Library/LaunchAgents/org.thetripps.isync.plist
   #+header: :tangle-mode (identity #o640)
   #+BEGIN_SRC xml
     <?xml version="1.0" encoding="UTF-8"?>
     <!DOCTYPE plist PUBLIC "-//Apple Computer//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
     <plist version="1.0">
       <dict>
         <key>EnvironmentVariables</key>
         <dict>
           <key>PATH</key>
           <string>/usr/bin:/bin:/usr/sbin:/sbin:/usr/local/bin</string>
         </dict>

         <key>KeepAlive</key>
         <false/>

         <key>Label</key>
         <string>org.thetripps.isync</string>

         <key>ProgramArguments</key>
         <array>
           <string><<mail-sync-path()>></string>
         </array>

         <key>StartInterval</key>
         <integer>300</integer>

         <key>RunAtLoad</key>
         <true />

         <key>StandardOutPath</key>
         <string>/var/log/agents.user/org.thetripps.isync.log</string>
         <key>StandardErrorPath</key>
         <string>/var/log/agents.user/org.thetripps.isync.log</string>
       </dict>
     </plist>
   #+END_SRC

   Note that an exit status of 78 indicates a configuration error.

   #+name: install agent
   #+BEGIN_SRC sh :tangle no :results output list
      launchctl unload ~/Library/LaunchAgents/org.thetripps.isync.plist
      launchctl load   ~/Library/LaunchAgents/org.thetripps.isync.plist
      launchctl list | awk '/org.thetripps/ { print $0 }; /^PID/ { print $0 }'
   #+END_SRC

   #+RESULTS: install agent
   : - PID	Status	Label
   : - -	78	org.thetripps.emacs
   : - 61991	0	org.thetripps.isync
   : - -	0	org.thetripps.trashdownloads


