mail-in-emacs.html

<div id="outline-container-org078de96" class="outline-4">
<h4 id="org078de96">Secret Configurations</h4>
<div class="outline-text-4" id="text-org078de96">
<p>
Facilities for the evaluation of encrypted elisp configuration.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgd9d2e29"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">toby/get-secret-var</span> <span style="color: #b58900;">(</span>sym<span style="color: #b58900;">)</span>
  <span style="color: #2aa198; font-style: italic;">"Get the value of the symbol `</span><span style="color: #268bd2; font-weight: bold; font-style: italic;">sym</span><span style="color: #2aa198; font-style: italic;">' from the custom.el.gpg</span>
<span style="color: #2aa198; font-style: italic;">  customization/configuration file."</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">with-temp-buffer</span>
    <span style="color: #268bd2;">(</span>insert-file-contents <span style="color: #2aa198;">"~/.emacs.d/secrets/custom.el.gpg"</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>eval-buffer<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>alist-get sym toby/secret-custom<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org328e255"><span style="color: #2aa198;">(</span>toby/get-secret-var <span style="color: #b58900;">(</span>intern property<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9b5fd7a" class="outline-3">
<h3 id="org9b5fd7a"><span class="done ADOPTED">ADOPTED</span> mbsync</h3>
<div class="outline-text-3" id="text-org9b5fd7a">
<ul class="org-ul">
<li>State "EXPERIMENTAL" from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2018-02-13 Tue 07:25]</span></span></li>
<li>State "TODO"       from              <span class="timestamp-wrapper"><span class="timestamp">[2018-02-13 Tue 07:25]</span></span></li>

<li><a href="https://wiki.archlinux.org/index.php/Isync">ArchLinux Help Page</a></li>
<li><a href="http://isync.sourceforge.net/mbsync.html">mbsync man page</a></li>
<li><a href="http://pragmaticemacs.com/emacs/migrating-from-offlineimap-to-mbsync-for-mu4e/">Pragmatic Emacs mbsync Page</a></li>
</ul>


<div class="org-src-container">
<pre class="src src-conf"><span style="color: #586e75;"># </span><span style="color: #586e75;">-*- mode: conf -*-</span>
Expunge Both
SyncState *
</pre>
</div>
</div>

<div id="outline-container-org3fbca14" class="outline-4">
<h4 id="org3fbca14">GMail</h4>
<div class="outline-text-4" id="text-org3fbca14">
<ul class="org-ul">
<li>A script for retrieving encrypted authinfo</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh" id="orge7ce6c8">gpg2 -q --for-your-eyes-only --no-tty -d ~/.emacs.d/secrets/.authinfo.gpg | awk <span style="color: #2aa198;">'/imap\.gmail/ { print $8 }'</span>
</pre>
</div>

<ul class="org-ul">
<li>The mbsync configuration for the gmail account</li>
</ul>
<div class="org-src-container">
<pre class="src src-conf" id="orgc459ed3">IMAPAccount gmail
Host imap.gmail.com
Port 993
<span style="color: #268bd2;">User &lt;&lt; get-secret(property</span>=<span style="color: #2aa198;">"gmail-user"</span>) &gt;&gt;
AuthMechs LOGIN
SSLType IMAPS
SystemCertificates no
CertificateFile /usr/local/etc/openssl/cert.pem
PassCmd <span style="color: #2aa198;">"&lt;&lt;gmail-password&gt;&gt;"</span>

IMAPStore gmail-remote
Account gmail
</pre>
</div>

<p>
Trailing slashes in mail directory entries are important.
</p>

<div class="org-src-container">
<pre class="src src-conf" id="org4b598a7">MaildirStore gmail-local
Path ~/.mail/gmail/
Inbox ~/.mail/gmail/Inbox
SubFolders Verbatim
</pre>
</div>

<p>
Patterns match remote mail folders for syncing:
</p>

<p>
#+tblname pattern-examples
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Pattern</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">*</td>
<td class="org-left">Match everything</td>
</tr>

<tr>
<td class="org-left">!DIR</td>
<td class="org-left">Exclude DIR</td>
</tr>

<tr>
<td class="org-left">DIR</td>
<td class="org-left">Include DIR</td>
</tr>
</tbody>
</table>

<p>
For example:
</p>
<div class="org-src-container">
<pre class="src src-conf" id="orgc4924b4">Patterns ![Gmail]* <span style="color: #2aa198;">"[Gmail]/Sent Mail"</span> <span style="color: #2aa198;">"[Gmail]/Starred"</span> <span style="color: #2aa198;">"[Gmail]/All Mail"</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-conf" id="org3c68069">Channel gmail-inbox
Master :gmail-remote:
Slave :gmail-local:
Patterns <span style="color: #2aa198;">"INBOX"</span> <span style="color: #2aa198;">"Record*"</span> <span style="color: #2aa198;">"Group*"</span>
Create Both

Channel gmail-trash
Master :gmail-remote:<span style="color: #2aa198;">"[Gmail]/Trash"</span>
Slave :gmail-local:trash
Create Both
Expunge Both

Channel gmail-sent
Master :gmail-remote:<span style="color: #2aa198;">"[Gmail]/Sent Mail"</span>
Slave :gmail-local:sent
Create Both
Expunge Both

Channel gmail-archive
Master <span style="color: #2aa198;">":gmail-remote:[Gmail]/All Mail"</span>
Slave :gmail-local:archive
Create Both
</pre>
</div>

<p>
Groups put together Channels, so that we can invoke <code>mbsync</code> on a Group to
sync all Channels, for instance: <code>mbsync gmail</code> gets mail from
"gmail-inbox", "gmail-sent", and "gmail-trash"
</p>

<div class="org-src-container">
<pre class="src src-conf" id="orge452356">Group gmail
Channel gmail-inbox
Channel gmail-sent
Channel gmail-trash
Channel gmail-archive
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh" id="org91e8a34">mkdir -p ~/.mail/gmail
mbsync -al
</pre>
</div>
</div>
</div>

<div id="outline-container-org1fef275" class="outline-4">
<h4 id="org1fef275">iCloud</h4>
<div class="outline-text-4" id="text-org1fef275">
<p>
This configuration uses authentication info stored in the MacOS Keychain.
I'm not convinced this is better or worse than authinfo.
</p>

<div class="org-src-container">
<pre class="src src-conf" id="org8a5f399">IMAPAccount icloud
Host imap.mail.me.com
Port 993
<span style="color: #268bd2;">User &lt;&lt;get-secret(property</span>=<span style="color: #2aa198;">"icloud-user"</span>)&gt;&gt;
PassCmd <span style="color: #2aa198;">"security find-internet-password -s imap.mail.me.com -w"</span>
AuthMechs LOGIN PLAIN
SSLType IMAPS
SSLVersions TLSv1.2
SystemCertificates no
CertificateFile /usr/local/etc/openssl/cert.pem

IMAPStore icloud-remote
Account icloud
</pre>
</div>

<div class="org-src-container">
<pre class="src src-conf" id="org6241f37">MaildirStore icloud-local
Path ~/.mail/icloud/
Inbox ~/.mail/icloud/Inbox
Trash Trash
</pre>
</div>

<div class="org-src-container">
<pre class="src src-conf" id="org90275c1">Channel icloud-folders
Master :icloud-remote:
Slave :icloud-local:
Patterns <span style="color: #2aa198;">"INBOX"</span> <span style="color: #2aa198;">"Saved"</span> <span style="color: #2aa198;">"Drafts"</span> <span style="color: #2aa198;">"Archive"</span> <span style="color: #2aa198;">"Sent*"</span> <span style="color: #2aa198;">"Trash"</span>
Create Both
Expunge Both
SyncState *
</pre>
</div>

<div class="org-src-container">
<pre class="src src-conf" id="org38fe081">Group icloud
Channel icloud-folders
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh" id="org23a0349">mkdir -p ~/.mail/icloud
mbsync -l icloud
</pre>
</div>
</div>
</div>
</div>
