org-init/mail-in-emacs.org
** ADOPTED Mail indexing with =mu=
   - State "EXPERIMENTAL" from              [2018-02-09 Fri 22:16]

   - [[https://emacs-fu.blogspot.com/2011/03/searching-e-mails-with-wanderlust-and.html][Emacs-Fu: Searching emails with wanderlust and mu]]

   - A sync script for use by the OS Scheduler:
     #+header: :tangle ~/bin/mail-sync
     #+header: :mkdirp yes
     #+header: :tangle-mode (identity #o750)
     #+header: :shebang #!/bin/bash
     #+name: mail-sync-script
     #+BEGIN_SRC sh
       exec &> >(while read line; do echo "$(date -R) $line"; done;)

       which -s mbsync
       if [[ $? -ne 0 ]]; then
           brew install isync
       fi

       which -s mu
       if [[ $? -ne 0 ]]; then
           brew install mu
       fi

       echo Mail Sync &&
           mbsync -Va &&
           echo Mail Index &&
           mu index --maildir=~/.mail --lazy-check
     #+END_SRC

** ADOPTED =org-capture= Integration

   - State "EXPERIMENTAL" from              [2018-02-10 Sat 07:01]

   #+name: define-capture-keys
   #+BEGIN_SRC emacs-lisp
     (global-unset-key (kbd "<f3>"))
     (global-set-key (kbd "<f3>") 'wl)

     (defun toby/load-wl ()
       (require 'org-wl)
       (fullframe wl bury-buffer nil))

     (eval-after-load 'wl #'toby/load-wl)

     (defun toby/mail-init ()
       (define-key wl-folder-mode-map (kbd "q") 'bury-buffer)
       (define-key wl-folder-mode-map (kbd "Q") 'wl-exit))

     (add-hook 'wl-hook #'toby/mail-init)
   #+END_SRC

   #+RESULTS: define-capture-keys
   | toby/mail-init |

   - [X] Figure out how to auto-load this package on wanderlust init
     - the approach in [[*BBDB for Contacts][BBDB for Contacts]] would probably work

   With this, you can mark text in a Wanderlust email view and type =C-c c e=
   to create an =org= node with the marked contents.  Meta-data about the
   current email will automatically be included.

*** Starting Up for Reading

    =M-x wl=

** ADOPTED Setting wanderlust as the Emacs Mail composer

   - State "ADOPTED"    from "EXPERIMENTAL" [2018-02-28 Wed 20:41]
   - State "EXPERIMENTAL" from              [2018-02-10 Sat 22:42]

   Open a message for writing with =wl-draft=

   #+name: wanderlust composition set-up
   #+BEGIN_SRC emacs-lisp
     (autoload 'wl-user-agent-compose "wl-draft" nil t)
     (if (boundp 'mail-user-agent)
         (setq mail-user-agent 'wl-user-agent))

     (if (fboundp 'define-mail-user-agent)
         (define-mail-user-agent
           'wl-user-agent
           'wl-user-agent-compose
           'wl-draft-send
           'wl-draft-kill
           'mail-send-hook))
   #+END_SRC

*** ADOPTED Try GMail for SMTP

    - State "ADOPTED"    from "TODO"       [2018-02-28 Wed 20:39]

    #+tblname: GMail IMAP Settings
    |-----------------------------+-----------------------+-------|
    | Incoming Mail (IMAP) Server |        imap.gmail.com |       |
    |-----------------------------+-----------------------+-------|
    |                             |                   <r> | <5>   |
    |                             |         Requires SSL: | Yes   |
    |                             |                 Port: | 993   |
    |-----------------------------+-----------------------+-------|
    | Outgoing Mail (SMTP) Server |        smtp.gmail.com |       |
    |-----------------------------+-----------------------+-------|
    |                             |                   <r> |       |
    |                             |          Requires SSL | Yes   |
    |                             |          Requires TLS | Yes[fn:tls] |
    |                             |          Port for SSL | 465   |
    |                             | Port for TLS/STARTTLS | 587   |

    #+name: smtp-set-up
    #+BEGIN_SRC emacs-lisp
       (let* ((smtp-server (toby/get-secret-var 'smtp-server))
              (smtp-config (toby/auth-info :host smtp-server)))
         (setq wl-smtp-authenticate-type "plain"
               wl-smtp-posting-server    (alist-get :host smtp-config)
               wl-smtp-posting-port      (alist-get :port smtp-config)
               wl-smtp-posting-user      (alist-get :user smtp-config)
               wl-from           (toby/get-secret-var 'toby/mail-from)
               wl-smtp-connection-type   (quote ssl)))
    #+END_SRC

    #+RESULTS: smtp-set-up
    : ssl

