mail-in-emacs.html

<div id="outline-container-org692690d" class="outline-3">
<h3 id="org692690d"><span class="done ADOPTED">ADOPTED</span> <code>org-capture</code> Integration</h3>
<div class="outline-text-3" id="text-org692690d">
<ul class="org-ul">
<li>State "EXPERIMENTAL" from              <span class="timestamp-wrapper"><span class="timestamp">[2018-02-10 Sat 07:01]</span></span></li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgdd1fbb1"><span style="color: #2aa198;">(</span>global-unset-key <span style="color: #b58900;">(</span>kbd <span style="color: #2aa198;">"&lt;f3&gt;"</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span>global-set-key <span style="color: #b58900;">(</span>kbd <span style="color: #2aa198;">"&lt;f3&gt;"</span><span style="color: #b58900;">)</span> 'wl<span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span>eval-after-load 'wl
  '<span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">progn</span>
     <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">require</span> '<span style="color: #268bd2; font-weight: bold;">org-wl</span><span style="color: #268bd2;">)</span>
     <span style="color: #268bd2;">(</span>define-key wl-folder-mode-map <span style="color: #dc322f;">(</span>kbd <span style="color: #2aa198;">"q"</span><span style="color: #dc322f;">)</span> 'bury-buffer<span style="color: #268bd2;">)</span>
     <span style="color: #268bd2;">(</span>define-key wl-folder-mode-map <span style="color: #dc322f;">(</span>kbd <span style="color: #2aa198;">"Q"</span><span style="color: #dc322f;">)</span> 'wl-exit<span style="color: #268bd2;">)</span>
     <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">fullframe</span> wl bury-buffer nil<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>

<ul class="org-ul">
<li class="on"><code>[X]</code> Figure out how to auto-load this package on wanderlust init
<ul class="org-ul">
<li>the approach in <a href="#org3422e21">BBDB for Contacts</a> would probably work</li>
</ul></li>
</ul>

<p>
With this, you can mark text in a Wanderlust email view and type <code>C-c c e</code>
to create an <code>org</code> node with the marked contents.  Meta-data about the
current email will automatically be included.
</p>
</div>

<div id="outline-container-org80ce7c9" class="outline-4">
<h4 id="org80ce7c9">Starting Up for Reading</h4>
<div class="outline-text-4" id="text-org80ce7c9">
<p>
<code>M-x wl</code>
</p>
</div>
</div>
</div>

<div id="outline-container-org21c110c" class="outline-3">
<h3 id="org21c110c"><span class="done ADOPTED">ADOPTED</span> Setting wanderlust as the Emacs Mail composer</h3>
<div class="outline-text-3" id="text-org21c110c">
<ul class="org-ul">
<li>State "ADOPTED"    from "EXPERIMENTAL" <span class="timestamp-wrapper"><span class="timestamp">[2018-02-28 Wed 20:41]</span></span></li>
<li>State "EXPERIMENTAL" from              <span class="timestamp-wrapper"><span class="timestamp">[2018-02-10 Sat 22:42]</span></span></li>
</ul>

<p>
Open a message for writing with <code>wl-draft</code>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgda83aa9"><span style="color: #2aa198;">(</span>autoload 'wl-user-agent-compose <span style="color: #2aa198;">"wl-draft"</span> nil t<span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span>boundp 'mail-user-agent<span style="color: #b58900;">)</span>
    <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">setq</span> mail-user-agent 'wl-user-agent<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span>fboundp 'define-mail-user-agent<span style="color: #b58900;">)</span>
    <span style="color: #b58900;">(</span>define-mail-user-agent
      'wl-user-agent
      'wl-user-agent-compose
      'wl-draft-send
      'wl-draft-kill
      'mail-send-hook<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>

<div id="outline-container-orgfd26226" class="outline-4">
<h4 id="orgfd26226"><span class="done ADOPTED">ADOPTED</span> Try GMail for SMTP</h4>
<div class="outline-text-4" id="text-orgfd26226">
<ul class="org-ul">
<li>State "ADOPTED"    from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2018-02-28 Wed 20:39]</span></span></li>
</ul>

<table id="org88558d3" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Incoming Mail (IMAP) Server</th>
<th scope="col" class="org-right">imap.gmail.com</th>
<th scope="col" class="org-right">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">Requires SSL:</td>
<td class="org-right">Yes</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">Port:</td>
<td class="org-right">993</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Outgoing Mail (SMTP) Server</td>
<td class="org-right">smtp.gmail.com</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">Requires SSL</td>
<td class="org-right">Yes</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">Requires TLS</td>
<td class="org-right">Yes<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">Port for SSL</td>
<td class="org-right">465</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">Port for TLS/STARTTLS</td>
<td class="org-right">587</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgd31fbf7"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">let*</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">(</span>smtp-server <span style="color: #dc322f;">(</span>toby/get-secret-var 'smtp-server<span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>
       <span style="color: #268bd2;">(</span>smtp-config <span style="color: #dc322f;">(</span>toby/auth-info <span style="color: #268bd2; font-style: italic;">:host</span> smtp-server<span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">setq</span> wl-smtp-authenticate-type <span style="color: #2aa198;">"plain"</span>
        wl-smtp-posting-server    <span style="color: #268bd2;">(</span>alist-get <span style="color: #268bd2; font-style: italic;">:host</span> smtp-config<span style="color: #268bd2;">)</span>
        wl-smtp-posting-port      <span style="color: #268bd2;">(</span>alist-get <span style="color: #268bd2; font-style: italic;">:port</span> smtp-config<span style="color: #268bd2;">)</span>
        wl-smtp-posting-user      <span style="color: #268bd2;">(</span>alist-get <span style="color: #268bd2; font-style: italic;">:user</span> smtp-config<span style="color: #268bd2;">)</span>
        wl-from           <span style="color: #268bd2;">(</span>toby/get-secret-var 'toby/mail-from<span style="color: #268bd2;">)</span>
        wl-smtp-connection-type   <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">quote</span> ssl<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
