org-init/mail-in-emacs.org
*** TODO BBDB for Contacts [0/1]
    - State "ADOPTED"    from "EXPERIMENTAL" [2018-03-01 Thu 12:33]
    - State "EXPERIMENTAL" from "TODO"       [2018-02-21 Wed 12:46]
    - State "TODO"       from              [2018-02-21 Wed 12:46]

    - Referenced
      - [[https://www.emacswiki.org/emacs/CategoryBbdb][Emacs Wiki Entry]]
      - [[http://bbdb.sourceforge.net/bbdb.html][BBDB Manual]]
      - [[https://emacs-fu.blogspot.com/2009/08/managing-e-mail-addresses-with-bbdb.html][Emacs-Fu Blog Entry]]

    - [ ] [[https://www.emacswiki.org/emacs/BBDBV3-Wl][BBDB Wanderlust Integration]]
      - [ ] “BBDB: MUA ‘mime-view-mode’ Not Supported”
        - [[bbdb-init][bbdb-init]] some change (it's unclear which) fixed this
        - [ ] Turns out that it didn't There is a problem with the hook in
          =wl-message-redisplay-hook=, currently set to:
          =bbdb-mua-auto-update=.  This function appears unable or unwilling
          to parse the headers from a message viewed with
          =mime-view-mode=. [[http://savannah.nongnu.org/git/?group=bbdb][BBDB Source Repo]].


    #+NAME: bbdb-init
    #+BEGIN_SRC emacs-lisp
      (require-package 'bbdb (version-to-list "3.2"))
      (eval-after-load 'wl
        '(progn
           (require 'bbdb-wl)
           (bbdb-initialize 'wl)
           (bbdb-insinuate-wl)
           (bbdb-mua-auto-update-init 'wl)))
    #+END_SRC

** Package Declaration Here
   #+BEGIN_SRC emacs-lisp
     (provide 'mail-in-emacs)
   #+END_SRC

*** Archive                                                         :ARCHIVE:
**** REJECTED Configure OAuth2 Authentication
     :PROPERTIES:
     :ARCHIVE_TIME: 2018-03-03 Sat 23:44
     :END:
     - State "TODO"       from "EXPERIMENTAL" [2018-02-10 Sat 12:11]
     - State "EXPERIMENTAL" from              [2018-02-10 Sat 12:11]

     [[https://hobo.house/2017/07/17/using-offlineimap-with-the-gmail-imap-api/][Using Offlineimap with the Gmail IMAP API]] <2018-02-10 Sat 12:13>

**** REJECTED OfflineIMAP
     :PROPERTIES:
     :ARCHIVE_TIME: 2018-02-23 Fri 08:26
     :END:
     - State "REJECTED"   from "EXPERIMENTAL" [2018-02-21 Wed 16:49]
     - State "EXPERIMENTAL" from              [2018-02-10 Sat 22:54]
***** TODO .offlineimaprc

      - State "TODO"       from              [2018-02-10 Sat 22:56]

      This config file should probably be managed in this repo (where it is
      used) rather in dotfiles.

** Footnotes

[fn:tls]  If available


