mail-in-emacs.html

<div id="outline-container-org3422e21" class="outline-4">
<h4 id="org3422e21"><span class="todo TODO">TODO</span> BBDB for Contacts <code>[0/1]</code></h4>
<div class="outline-text-4" id="text-org3422e21">
<ul class="org-ul">
<li>State "ADOPTED"    from "EXPERIMENTAL" <span class="timestamp-wrapper"><span class="timestamp">[2018-03-01 Thu 12:33]</span></span></li>
<li>State "EXPERIMENTAL" from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2018-02-21 Wed 12:46]</span></span></li>
<li>State "TODO"       from              <span class="timestamp-wrapper"><span class="timestamp">[2018-02-21 Wed 12:46]</span></span></li>

<li>Referenced
<ul class="org-ul">
<li><a href="https://www.emacswiki.org/emacs/CategoryBbdb">Emacs Wiki Entry</a></li>
<li><a href="http://bbdb.sourceforge.net/bbdb.html">BBDB Manual</a></li>
<li><a href="https://emacs-fu.blogspot.com/2009/08/managing-e-mail-addresses-with-bbdb.html">Emacs-Fu Blog Entry</a></li>
</ul></li>

<li class="off"><code>[&#xa0;]</code> <a href="https://www.emacswiki.org/emacs/BBDBV3-Wl">BBDB Wanderlust Integration</a>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> “BBDB: MUA ‘mime-view-mode’ Not Supported”
<ul class="org-ul">
<li><a href="#orgeafb798">bbdb-init</a> some change (it's unclear which) fixed this</li>
<li class="off"><code>[&#xa0;]</code> Turns out that it didn't There is a problem with the hook in
<code>wl-message-redisplay-hook</code>, currently set to:
<code>bbdb-mua-auto-update</code>.  This function appears unable or unwilling
to parse the headers from a message viewed with
<code>mime-view-mode</code>. <a href="http://savannah.nongnu.org/git/?group=bbdb">BBDB Source Repo</a>.</li>
</ul></li>
</ul></li>
</ul>


<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgeafb798"><span style="color: #2aa198;">(</span>require-package 'bbdb <span style="color: #b58900;">(</span>version-to-list <span style="color: #2aa198;">"3.2"</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span>eval-after-load 'wl
  '<span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">progn</span>
     <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">require</span> '<span style="color: #268bd2; font-weight: bold;">bbdb-wl</span><span style="color: #268bd2;">)</span>
     <span style="color: #268bd2;">(</span>bbdb-initialize 'wl<span style="color: #268bd2;">)</span>
     <span style="color: #268bd2;">(</span>bbdb-insinuate-wl<span style="color: #268bd2;">)</span>
     <span style="color: #268bd2;">(</span>bbdb-mua-auto-update-init 'wl<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org15eef57" class="outline-3">
<h3 id="org15eef57">Package Declaration Here</h3>
<div class="outline-text-3" id="text-org15eef57">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">provide</span> '<span style="color: #268bd2; font-weight: bold;">mail-in-emacs</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>

<div id="outline-container-org9925a60" class="outline-4">
<h4 id="org9925a60">Archive&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ARCHIVE">ARCHIVE</span></span></h4>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
If available
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Toby Tripp</p>
<p class="date">Created: 2018-03-04 Sun 00:23</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
